app/controllers/channels_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    @channels = Channel.all

SELECT  "channels".* FROM "channels" WHERE "channels"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_channel
      @channel = Channel.find(params[:id])