app/controllers/users_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."user_id" = ?  [["user_id", 11]]
---
  def show
    @inputs = []

    @user.channels.each do |channel|

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fvdv"], ["email", "dfvfv"], ["password", "dfvdfv"], ["created_at", "2016-12-19 18:12:26.520989"], ["updated_at", "2016-12-19 18:12:26.520989"]]
---
  def create
    @user = User.new(user_params)

    if @user.save